'''แบบฝึกหัด 8-1 
ข้อที่ 1 จงสร้างตัวแปรชือ d236 เป็นดิกมีคู่ key, value 3 คู่ 
คือ "TWO", "THREE" และ "SIX" เป็นคีย์ มีค่าที่คู่กันคือ "สอง", "สาม" และ "หก" 
ตามลำดับ (เขียนการสร้างตัวแปรแค่บรรทัดเดียว)'''

d236 = {'TWO':'สอง', 'THREE':'สาม', 'SIX':'หก'}
print(d236)


'''แบบฝึกหัด 8-1 ข้อที่ 2
โปรแกรมนี้มีดิกชื่อ color ที่ตั้งค่าให้เรียบร้อยแล้ว จากนั้นรับชื่อย่อวันจากอินพุต เพื่อแสดงสีประจำวันที่รับมา จงเติมคำสั่งที่ ??? เพื่อให้ทำงานตามที่ต้องการ'''

color = {"SU": "Red", "MO": "Yellow", 
         "TU": "Pink", "WE": "Green",
         "TH": "Orange", "FR": "Blue", 
         "SA": "Purple" }

day = 'MO'
print(color[day])


'''แบบฝึกหัด 8-1 ข้อที่ 3
โปรแกรมนี้มีตัวแปร student1 เป็นดิกเก็บรายละเอียดของนักเรียนคนหนึ่ง จากนั้นไปอ่านรายละเอียด (ด้วยฟังก์ชัน read_data ที่ไม่ได้เปิดเผยรายละเอียด) ของนักเรียนอีกคนเก็บใน student2 (ซึ่งจัดเก็บในรูปแบบเดียวกับ student1) จงเขียนคำสั่งแสดงปีเกิดของ student2'''

student1 = {"ID": "5830000021", 
            "Name": "Pranpriya M.", 
            "Birthdate": [27, 3, 1997]}

def read_data():
    return student1

# มีรูปแบบการจัดเก็บเหมือน student1
student2 = read_data()

# แสดงปีเกิดของ student2 
print( student2['Birthdate'][2] )


