'''📝 แบบฝึกหัด Dictionary (Level 2: Logic & Calculation)
ข้อที่ 1: เช็คสต็อกและมูลค่ารวม โปรแกรมนี้มีดิก 2 ตัว: prices (ราคาต่อชิ้น) 
และ stock (จำนวนสินค้าที่มี) จงเขียนโค้ดเพื่อคำนวณ 
"มูลค่าสินค้ารวมทั้งหมดในร้าน" (เอา ราคา x จำนวน ของทุกชิ้น แล้วมาบวกกัน)'''

prices = {'Apple':30, 'Banana':10, 'Cherry':20}
stock = {'Apple':5, 'Banana':5, 'Cherry':15}

total_value = 0

# วนลูปอ่านชื่อสินค้า (key) ใน prices
for fruit in prices:
    # ดึงราคาของ ผลไม้แต่ละตัวออกมาเก็บในตัวแปร
    price = prices[fruit]
    # ดึงจำนวน... ซึงใช้ key เดียวกันกับ price
    qty = stock[fruit]

    # นำ จำนวณ * ราคา + สะสมแต่ละรอบไว้ในตัวแปร 
    total_value += qty * price 

print(f'มูลค่าสินค้ารวมทั้งหมดในร้าน: {total_value}')


'''ข้อที่ 2: นับคะแนนโหวต (Frequency Count) โจทย์นี้คลาสสิกมากครับ! เรามีลิสต์ votes เก็บผลโหวตเครื่องดื่ม จงสร้างดิก result เพื่อเก็บว่า "แต่ละเมนูได้กี่คะแนน?"
ถ้าเมนูนั้นยังไม่มีในดิก -> ให้เริ่มนับ 1
ถ้ามีแล้ว -> ให้บวกเพิ่มอีก 1'''

votes = ["Coffee", "Tea", "Coffee", "Milk", "Tea", "Coffee"]
result = {}

for v in votes:
    if v in result:
        result[v] += 1
    else:
        result[v] = 1

print(result)


'''ข้อที่ 3: เกรดเฉลี่ยรายบุคคล (Nested Dict) มีข้อมูลคะแนนสอบของนักเรียนเก็บใน students จงเขียนโค้ดเพื่อหา "คะแนนเฉลี่ย" 
ของนาย "Somchai" เท่านั้น'''

students = {
    "Somsak": {"Math": 80, "Eng": 70, "Sci": 75},
    "Somchai": {"Math": 60, "Eng": 80, "Sci": 90},
    "Somying": {"Math": 90, "Eng": 95, "Sci": 80}
}

target = "Somchai"
scores = students[target] # ได้ดิกย่อยออกมาคือ {'Math': 60, 'Eng': 80, 'Sci': 90}

total_score = 0
count = 0

# วนลูปอ่านคะแนนในดิกย่อย
for subject in scores:
    # เอาคะแนนบวกใส่ total_score
    total_score = total_score + scores[subject] 
    # ??? (ใบ้: scores[subject])
    
    count += 1 # นับวิชา

average = total_score / count
print(f"คะแนนเฉลี่ยของ {target} คือ {average}")

'''ข้อที่ 4: ใครได้คะแนนเยอะสุด? (Max Value Logic) มีดิก scores 
เก็บคะแนนพนักงาน จงเขียนโค้ดเพื่อหาว่า "ใคร" (ชื่อคน) 
คือคนที่ได้คะแนนเยอะที่สุด'''

scores = {"Emp1": 85, "Emp2": 92, "Emp3": 78, "Emp4": 88}

winner_name = ''
max_score = 0

for name, score in scores.items():
    if score > max_score:
        winner_name = name
        max_score = score

print(f'ผู้ชนะคือ {winner_name} ด้วยคะแนน {max_score} คะแนน')

'''ข้อที่ 5: แยกประเภทเลขคู่-คี่ (Grouping) มีลิสต์ตัวเลข numbers 
จงแยกตัวเลขใส่ลงในดิก grouped โดยแยกเป็นคีย์ "even" (เลขคู่) และ "odd" 
(เลขคี่)'''

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]

grouped = {
    'even': [],
    'odd': []
}

for i in numbers:
    if i % 2 == 0:
        grouped['even'].append(i)
    else:
        grouped['odd'].append(i)

print(grouped['even'])
print(grouped['odd'])