'''📝 แบบฝึกหัด Dictionary (Level 2: Logic & Calculation)
ข้อที่ 1: เช็คสต็อกและมูลค่ารวม โปรแกรมนี้มีดิก 2 ตัว: prices (ราคาต่อชิ้น) 
และ stock (จำนวนสินค้าที่มี) จงเขียนโค้ดเพื่อคำนวณ 
"มูลค่าสินค้ารวมทั้งหมดในร้าน" (เอา ราคา x จำนวน ของทุกชิ้น แล้วมาบวกกัน)'''

prices = {'Apple':30, 'Banana':10, 'Cherry':20}
stock = {'Apple':5, 'Banana':5, 'Cherry':15}

total_value = 0

# วนลูปอ่านชื่อสินค้า (key) ใน prices
for fruit in prices:
    # ดึงราคาของ ผลไม้แต่ละตัวออกมาเก็บในตัวแปร
    price = prices[fruit]
    # ดึงจำนวน... ซึงใช้ key เดียวกันกับ price
    qty = stock[fruit]

    # นำ จำนวณ * ราคา + สะสมแต่ละรอบไว้ในตัวแปร 
    total_value += qty * price 

print(f'มูลค่าสินค้ารวมทั้งหมดในร้าน: {total_value}')


'''ข้อที่ 2: นับคะแนนโหวต (Frequency Count) โจทย์นี้คลาสสิกมากครับ! เรามีลิสต์ votes เก็บผลโหวตเครื่องดื่ม จงสร้างดิก result เพื่อเก็บว่า "แต่ละเมนูได้กี่คะแนน?"
ถ้าเมนูนั้นยังไม่มีในดิก -> ให้เริ่มนับ 1
ถ้ามีแล้ว -> ให้บวกเพิ่มอีก 1'''

votes = ["Coffee", "Tea", "Coffee", "Milk", "Tea", "Coffee"]
result = {}

for v in votes:
    if v in result:
        result[v] += 1
    else:
        result[v] = 1

print(result)


'''ข้อที่ 3: เกรดเฉลี่ยรายบุคคล (Nested Dict) มีข้อมูลคะแนนสอบของนักเรียนเก็บใน students จงเขียนโค้ดเพื่อหา "คะแนนเฉลี่ย" 
ของนาย "Somchai" เท่านั้น'''

