'''📝 แบบฝึกหัดเตรียมความพร้อม (Dictionary)
ข้อที่ 1: จงสร้างตัวแปรชื่อ digits เป็นดิกเก็บคำอ่านเลขไทย โดยมี key 
เป็นตัวเลข (Integer) 1, 9, 0 และค่า (Value) คือ "หนึ่ง", "เก้า", "ศูนย์" 
ตามลำดับ (เขียนบรรทัดเดียว)'''

digits = {1:'หนึ่ง', 9:'เก้า', 0:'ศูนย์'}

print(digits)



'''ข้อที่ 2: โปรแกรมนี้มีดิกชื่อ caffeine 
เก็บปริมาณคาเฟอีนในเครื่องดื่ม (มิลลิกรัม) 
จงเติมคำสั่งใน print 
เพื่อแสดงปริมาณคาเฟอีนของเครื่องดื
่มที่เก็บในตัวแปร order'''

caffeine = {"Espresso": 63, "Latte": 80, 
            "Monster": 160, "Redbull": 80}

order = "Latte"
# เติมคำสั่งในวงเล็บ
print( caffeine )
print( caffeine[order] )


'''ข้อที่ 3: โปรแกรมนี้มีดิก movie เก็บรายละเอียดหนัง 
จงเขียนคำสั่งเพื่อแสดง "ชื่อนักแสดงคนสุดท้าย" ในลิสต์ Actors ของหนังเรื่องนี้ 
(ต้องใช้ Index มาช่วยนะ)'''

movie = {
    "Title": "Iron Man",
    "Year": 2008,
    "Actors": ["Robert Downey Jr.", "Gwyneth Paltrow", "Terrence Howard"]
}

# จงแสดงชื่อ "Terrence Howard" ออกมา
print( movie["Actors"][2] )


'''ข้อที่ 4: โปรแกรมนี้มีดิก scores เก็บขะแนนสอบของนักเรียน จงเขียนคำสั่ง 
แก้ไขคะแนน ของ "Somchai" จากเดิม 65 ให้เป็น 80 แล้วสั่ง print ดิกออกมาดูผล'''

scores = {"Somsak": 70, "Somchai": 65, "Somying": 90}

# เขียนคำสั่งแก้ไขคะแนนตรงนี้
scores["Somchai"] = 80

print(scores)


'''ข้อที่ 5 (Boss ข้อนี้): โปรแกรมนี้เก็บข้อมูลพนักงานในชื่อ 
staff ซึ่งซับซ้อนหน่อย คือเก็บที่อยู่ (Address) เป็นดิกซ้อนอยู่อีกที 
จงเขียนคำสั่งเพื่อแสดง "รหัสไปรษณีย์ (Zip)" ของพนักงานคนนี้ออกมา'''


staff = {
    "ID": "EMP001",
    "Name": "Nattapong",
    "Address": {
        "Province": "Bangkok",
        "District": "Ladprao",
        "Zip": "10230"
    }
}

# จงแสดงเลข "10230" ออกมา
print( staff['Address']['Zip'] )