'''แบบฝึกหัด 8-2 
ข้อที่ 1 จงสร้างตัวแปรชื่อ count_alpha เป็นดิกที่มี key 
เป็นตัวอักษรอังกฤษทั้งใหญ่และเล็กทุกตัวอักษร ส่วน value ให้เป็น 0 หมด'''

count_alpha = {}
alpha = 'ABCDEFGHIJKLNMOPQRSTUVWXYZ'
alpha += alpha.lower()
for c in alpha:
    count_alpha[c] = 0

print(count_alpha)


'''แบบฝึกหัด 8-2 ข้อที่ 2
มีดิกชื่อ number_of_students อยู่แล้วตัวหนึ่ง จัดเก็บข้อมูลในรูปแบบ 
{รหัสวิชา: จำนวนนิสิตที่ลงทะเบียน} โดยรหัสวิชาเป็นสตริง 
จงเขียนคำสั่งเพิ่มจำนวนนิสิตที่ลงทะเบียนให้กับวิชา 2110101 อีก 28 คน 
และตั้งให้วิชา 2301107 มีนิสิตลงทะเบียน 824 คน'''

number_of_students = {'2110101': 440, '2110211': 120, '2110183': 7}
number_of_students['2110101'] += 28
number_of_students['2301107'] = 824

print(number_of_students)

'''แบบฝึกหัด 8-2 ข้อที่ 3
โปรแกรมนี้มีตัวแปร student1 เป็นดิกเก็บรายละเอียดของนักเรียนคนหนึ่ง 
จงเขียนฟังก์ชัน read_data() มีหน้าที่อ่านข้อมูลจากอินพุตประกอบด้วย 
เลขประจำตัว, ชื่อ-สกุล, วัน, เดือน, ปีเกิด (คั่นด้วย comma และช่องว่าง) 
มาเก็บในดิกที่มีรูปแบบเดียวกับ student1 แล้วคืนเป็นผลของฟังก์ชัน เช่น 
อินพุตเป็น 4230000021, Natalie P., 9, 6, 1981 จะได้ผลจาก read_data เป็น 
{"ID": "4230000021", "Name": "Natalie P.", "Birthdate": [9, 6, 1981]}'''


student1 = {"ID": "5830000021", 
            "Name": "Pranpriya M.", 
            "Birthdate": [27, 3, 1997]}

data = '12345, George L., 14, 5, 1944'

# แบบของอาจารย์
def read_data(x):
    x = x.split(", ")
    r = {}
    r["ID"] = x[0]
    r["Name"] = x[1]
    r["Birthdate"] = [int(x[2]), int(x[3]), int(x[4])]
    return r

# แบบป๋าเขียนเอง
def read_data2(x):
    x = x.split(", ")
    s = {'ID':x[0],
            'Name':x[1],
            'Birthdate':[int(x[2]),int(x[3]),int(x[4])]
            }
    return s

print(read_data(data))
print(read_data2(data))


'''แบบฝึกหัด 8-2 ข้อที่ 4
จงเขียนโปรแกรมอ่านจากอินพุตบรรทัดเดียวเป็นรายการของชื่อย่อจังหวัด 
อังกฤษกับไทย คั่นด้วยช่องว่าง เช่น BKK กทม CMI ชม เพื่อนำมาสร้างเป็นดิกชื่อ 
abbr = {"BKK": "กทม", 
        "CMI": "ชม", 
        "กทม": "BKK",
        "ชม": "CMI"}'''

j = 'CBI ชบ BKK กทม CMI ชม KBI กบ KNN ขก'
print('abbr: ', j)
x = j.split()
abbr = {}
for i in range(0, len(x), 2):
    abbr[x[i]] = x[i+1]
    abbr[x[i+1]] = x[i]

print('รวม abbr: ', abbr)


'''แบบฝึกหัด 8-2 ข้อที่ 5
จงเขียนฟังก์ชัน add(points, members, extra) รับดิก points 
ที่เก็บข้อมูลในรูปแบบ {รหัสสมาชิก: จำนวนแต้มสะสม}, members 
เป็นลิสต์เก็บรหัสสมาชิก กับ extra เป็นจำนวนแต้ม 
ฟังก์ชันนี้จะเพิ่มแต้มเป็นจำนวน extra ในดิก points 
ให้กับสมาชิกที่มีรหัสปรากฏใน members ฟังก์ชันนี้ไม่คืนอะไรเลย 
เพราะจะปรับข้อมูลใน points'''


