# มีตัวแปร x ซึ่งเป็นลิสต์ของจำนวนเต็มมาให้แล้ว
# การทำคำสั่งทั้งหมดต้องไม่เปลี่ยนค่าใน x
#

def slicing00():
    x = [0,1,2,3,4,5,6,7,8,9]
    print(x)

    # ให้ a เป็นจำนวนเต็มเก็บผลรวมของค่าใน x 
    #    ตัวที่ index 5,8 และสองตัวขวาสุดของ x
    a = x[5] + x[8] + x[-2] + x[-1]
    print(a)

    # ให้ b เป็นลิสต์เก็บเฉพาะที่ข้อมูลใน x
    #    ที่อยู่ ณ index ที่หารด้วย 3 ลงตัว
    b = x[::3]
    print(b)

    # ให้ c เป็นลิสต์เก็บค่ากลับลำดับกับค่าใน x
    c = x[::-1]
    print(c)

    # ให้ d เป็นลิสต์เก็บค่าใน x ที่ถูก "หมุน"
    #    ทางขวา 1 ครั้ง เช่น หมุน [1,2,3,4]
    #    ทางขวา 1 ครั้ง ได้ [4,1,2,3]
    d = x[-1::] + x[:-1]
    print(d)
    
    

slicing00()


# มีตัวแปร v1, v2 และ v3 ซึ่งเป็นลิสต์ของ
#    จำนวนจริง มาให้เรียบร้อยแล้ว
#
# v1, v2 และ v3 เป็นลิสต์ที่มี 3 ช่อง
# แต่ละลิสต์แทนเวกเตอร์ในสามมิติ
# จงตั้งค่าภายในของเวกเตอร์ v3 ให้เป็น
#   ผลบวกของเวกเตอร์ v1 กับ v2
#
def slicing01():
    v1 = [1.1, 2.2, 3.3]
    v2 = [4.4, 5.5, 6.6]
    v3 = [0.0, 0.0, 0.0]

    print(v1)
    print(v2)
    print(v3)

    '''
    แบบธรรมดา 
    v3[0] = v1[0] + v2[0]
    v3[1] = v1[1] + v2[1]
    v3[2] = v1[2] + v2[2]

    หรือใช้อีกวิธี
    for i in range(len(v1)):
        v3[i] = v1[i] + v2[i]

    '''
    
    # ใช้ enumerate เพื่อให้ได้ index (i)
    # และใช้ zip เพื่อให้ได้ค่า (k, v)
    for i, (k, v) in enumerate(zip(v1, v2)):
        v3[i] = k + v   # แทนที่ค่า v3 ที่ index i

    print(v3,'v3 update')

slicing01()

