# มีตัวแปร v1 กับ v2 ซึ่งเป็นลิสต์ของ
#    จำนวนจริง มาให้เรียบร้อยแล้ว
#
# v1 กับ v2 เป็นลิสต์ที่มี 3 ช่อง
# ลิสต์ทั้งคู่แทนเวกเตอร์ในสามมิติ
# จงแสดงค่า dot product ของ v1 กับ v2
v1 = [1.0, 2.0, 3.0]
v2 = [4.0, 5.0, 6.0]

# คำนวณ dot product 
# zip(v1, v2) จะสร้างคู่: (1.0, 4.0), (2.0, 5.0), (3.0, 6.0)
# (a * b for a, b in ...) จะคำนวณผลคูณของแต่ละคู่: 4.0, 10.0, 18.0
# sum(...) จะรวามผลลัพธ์: 4.0 + 10.0 + 18.0 = 32.0

dot_product = sum(a * b for a, b in zip(v1, v2))

# วิธีแปลง int หรือ float เป็น str แบบที่ 1
v1_str = ' '.join(str(num) for num in v1)
print(v1_str)

# วิธีแปลง int หรือ float เป็น str แบบที่ 2
v3 = [str(num) for num in v2]; 
v3 = ' '.join(v3)
print(v3)
print(dot_product)