'''
🏁 โจทย์ชุด "Range in Action" (ชุดที่ 2)
ข้อที่ 6: สามเหลี่ยมตัวเลข
Input: รับจำนวนเต็ม n หนึ่งตัว
Task: ให้พิมพ์สามเหลี่ยมตัวเลขตามรูปแบบด้านล่าง (ตัวอย่าง n=5)
'''
def for_range_n_06():
    n = 5

    # 1. ลูปนอก (i) ควบคุม "แถว" n = จำนวนแถวที่จะพิมพ์
    for i in range(1, n+1):

        # 2. ลูปใน (j) ควบคุม "ตัวเลขที่จะพิมพ์" ในแถวนั้นๆ
        for j in range(1, i+1):

            # 3. พิมพ์เลข j และเว้นวรรค (end=' ')
            print(j, end=' ')

        #4. เมื่อจบลูปใน ให้ print() เปล่าๆ เพื่อ "ขึ้นบรรทัดใหม่"
        print()
        
for_range_n_06()

'''
ข้อที่ 7: วิ่งยาวต่อเนื่อง (Longest Run)
Input: รับข้อความ s มาหนึ่งข้อความ
Task: หาว่าตัวอักษรใด "วิ่ง" (อยู่ติดกัน) ได้ยาวที่สุด และวิ่งได้กี่ตัว
Output: (ตัวอย่าง s = 'AABBBCCCCDAA')
'''

def for_longest_run():
    s = 'AABBBCCCCDAA'

    # 1. ตั้งค่าเริ่มต้น โดยอิงจาก "ตัวแรก" (index 0)
    max_char = s[0]     # เก็บสถิติ ตัวอักษร สูงสุด
    max_count = 1       # เก็บสถิติ จำนวน สูงสุด

    current_char = s[0] # ตัวที่กำลังนับ
    current_count = 1   # จำนวนที่นับได้ตอนนี้

    # 2. วนลูปตั้งแต่ "ตัวที่สอง" (index 1) ไปจนจบ
    # โดยใช้วิธี เที่ยบกับตัวก่อนหน้า 
    for i in range(1, len(s)):

        # 3. เช็กว่าตัวปัจจุบัน (s[i]) เหมือนตัวก่อนหน้า (s[i-1]) ไหม
        if s[i] == s[i-1]:

            # ถ้าเหมือน: ให้นับต่อ
            current_count += 1
        
        else:
            # ถ้าไม่เหมือน: เริ่มนับตัวใหม่
            current_char = s[i]
            current_count = 1
        
        # 4. หลังจากนับเสร็จ ตรวจสอบว่าทำลายสถิติหรือไม่
        if current_count > max_count:
            max_count = current_count
            max_char = s[i]

    print(f'{max_char} วิ่งได้ {max_count}')
for_longest_run()

'''
ข้อที่ 8: ผลรวมตัวหารแท้ (Proper Divisors)

Input: รับจำนวนเต็มบวก n

Task: หาผลรวมของ "ตัวหารแท้" (Proper Divisors) ของ n. (ตัวหารแท้คือตัวเลขที่หาร n ลงตัว โดยไม่นับตัว n เอง)

เช่น n = 6 ตัวหารแท้คือ 1, 2, 3

เช่น n = 10 ตัวหารแท้คือ 1, 2, 5

Output: (ตัวอย่าง n = 6)
'''

def for_peoper_divisors():
    n = 6   #int(input('num: '))

    # 1. ตั้งตัวแปรเก็บผลรวม
    total_sum = 0

    # 2. วนลูป i ตั้งแต่ 1 ถึง n-1
    # (range(1, n) จะวิ่งถึง n-1 พอดี)
    for i in range(1, n+1):

        # 3. ตรวจสอบว่า n หาร i ลงตัวหรือไม่
        if n % i == 0:
            # 4. ถ้า i เป็นตัวหารแท้ ให้บวกเข้าไปในผลรวม
            total_sum = i

    print(f"ผลรวมตัวหารแท้ของ {n} คือ: {total_sum}")
for_peoper_divisors()

'''
9. คู่ที่ผลรวมสูงสุด
คำใบ้: มี 2 ขั้นตอนครับ

ขั้นที่ 1: แปลง Input str (เช่น "1 5 9 3") ให้กลายเป็น list ของตัวเลข int ก่อน (อาจจะต้องใช้ .split() แล้ววนลูปแปลง int)

ขั้นที่ 2: พอได้ list ตัวเลขแล้ว ก็ใช้ for i in range(len(list)-1) (เหมือนข้อ 3 มนุษย์คู่ขนาน) เพื่อเช็ก list[i] + list[i+1] เทียบกับ 'ผลรวมสูงสุด' (max_sum) ที่ป๋าเคยเจอครับ
'''
def sum_list():
    digit = '1 5 9 3 4 6 2'

    # --- ขั้นที่ 1: เตรียมข้อมูล ---
    # แยก str ให้เป็น list และ แปลงเป็น int
    nums_int = list(map(int, digit.split(' ')))

    # --- ขั้นที่ 2: หาผลรวมสูงสุด ---
    # 1. ตั้งค่าเริ่มต้น (สถิติ) โดยใช้ "คู่แรก" เป็นตัวตั้ง
    max_sum = nums_int[0] + nums_int[1]
    max_pair = (nums_int[0], nums_int[1])

    # 2. วนลูปเพื่อเช็กทีละคู่ (เหมือนข้อ 3 ต้อง -1)
    for i in range(len(nums_int) -1):
        
        # 6. หาผลรวมของคู่ปัจจุบัน
        current_sum = nums_int[i] +  nums_int[i+1]
        
        # 7. เช็กว่าทำลายสถิติหรือไม่
        if current_sum > max_sum:
            max_sum = current_sum
            max_pair = (nums_int[i], nums_int[i+1])
    
    print(f'คู่ที่ร่วมกันได้มากสุดคือ {max_pair} รวมได้ {max_sum}')

sum_list()

'''
ข้อที่ 10: พาลินโดรม (Palindrome Checker)
Input: รับข้อความ s
Task: ตรวจสอบว่า s (เมื่อไม่สนตัวพิมพ์เล็ก/ใหญ่) อ่านจากหน้าไปหลัง และ หลังไปหน้า ได้เหมือนกันหรือไม่
Output:
madam -> True
Natta -> False
Racecar -> True
'''
def palindrome(s:str):
    
    # 1. แปลงเป็นตัวพิมพ์เล็กทั้งหมด
    s_clean = s.lower()
    s_clean = s.isalpha

    # 2. สร้าง string ที่กลับด้าน โดยใช้ Slicing
    # [::-1] หมายถึง "เริ่มแต่ต้นจนจบ แต่ก้าวทีละ -1 (ถอยหลัง)"
    s_reversed = s_clean[::-1]
    
    # 3. เปรียบเทียบ
    is_palindrome = (s_clean == s_reversed)

    # 4. แสดงผล
    print(f'ข้อความ: {s} เป็น palindrome: {is_palindrome}')

palindrome('Racecar')
palindrome('madam')
palindrome('Natta')

'''
หลักการใช้ 
for i in range กับ

for c in string

🥊 เปรียบเทียบชัดๆ: เลือกใช้อันไหนดี?
สถานการณ์ควรใช้แบบไหน?
ตัวอย่างโค้ดอยากนับว่ามี 'A' กี่ตัว
for c (ง่ายกว่า)
if c == 'A':

อยากเช็กว่าเป็นสระไหม
for c (ง่ายกว่า)
if c in 'aeiou':

อยากเทียบตัวหน้ากับตัวหลัง
for i (จำเป็น)
if text[i] == text[i+1]:

อยากเอา 2 ข้อความมาเทียบกัน
for i (จำเป็น)
if text1[i] == text2[i]:

อยากเปลี่ยนเฉพาะตัวที่ 3, 5, 7
for i (จำเป็น)
if i % 2 != 0:
'''



