'''
🏁 โจทย์ชุด "Mastering Range"
ข้อที่ 1: ผลรวมหารลงตัว
Input: รับจำนวนเต็ม n หนึ่งตัว
Task: ให้หาผลรวมของตัวเลขตั้งแต่ 1 ถึง n (รวม n) เฉพาะตัวที่ หารด้วย 3 ลงตัว เท่านั้น
Output: แสดงผลรวม
'''

def for_total_sum():
    n = 9# int(input('input num: ))
    total_sum = 0
    for num in range(1, n+1):
        if num % 3 == 0:
            total_sum += num
    print(f'total sum: {total_sum}')
for_total_sum()

'''
ข้อที่ 2: เด็กแนว (พิมพ์ถอยหลัง)
Input: รับจำนวนเต็ม n หนึ่งตัว
Task: ให้พิมพ์ตัวเลขตั้งแต่ n ไล่ลงมาจนถึง 0 (เช่น 5, 4, 3, 2, 1, 0)
โดยใช้ range
Output: ตัวเลขแต่ละตัว (จะบรรทัดเดียวหรือคนละบรรทัดก็ได้)
'''
def for_range_reverse():
    n = 9 #int(input('num: '))

    for i in range(n, -1, -1):
        print(i, end=' ')
# for_range_reverse()

'''
ข้อที่ 3: มนุษย์คู่ขนาน (Adjacent Pairs)
Input: รับข้อความ s มาหนึ่งข้อความ
Task: ให้นับว่ามีกี่คู่ที่ ตัวอักษรติดกันเป็นตัวเดียวกัน
เช่น AABB -> เจอ AA (1) และ BB (1) = ตอบ 2
เช่น Bookkeeper -> oo (1), kk (1), ee (1) = ตอบ 3
Output: จำนวนคู่ที่นับได้
'''
def for_adjacent_pairs():
    print()
    s = 'Bookkeeper' # input(': ')
    count = 0
    for i in range(len(s)-1):
        s = s.lower()

        if s[i] == s[i+1]:
            count += 1
    
    print(f': {count}')
for_adjacent_pairs()

'''
ข้อที่ 4: เฉพาะคนคู่ (Even Index)
Input: รับข้อความ s มาหนึ่งข้อความ
Task: ให้พิมพ์เฉพาะตัวอักษรที่อยู่ที่ตำแหน่ง Index คู่ (0, 2, 4, ...) 
ออกมาต่อกัน เช่น Python -> Index 0(P), 2(t), 4(o) 
-> ตอบ Pto 
Output: ข้อความใหม่ที่ประกอบด้วยตัวอักษรตำแหน่งคู่
'''
def for_even_index():
    text = 'Python' # input(text: )

    for i in range(0, len(text), 2):
        print(text[i], end='')
# for_even_index()

'''
ข้อที่ 5: แฟกทอเรียลทำมือ (Factorial)
Input: รับจำนวนเต็มบวก 
Task: จงคำนวณค่า n! (n แฟกทอเรียล) ซึ่งคือผลคูณจาก 1 ถึง n 
สูตร: n! = 1 x 2 x 3 x ... x n
เช่น รับ 5 -> คำนวณ 1 x 2 x 3 x 4 x 5 = 120
Output: ผลลัพธ์การคูณ
'''
def for_factorial():
    n = 5 # int(input(num n: ))
    total_sum = 1

    for i in range(1,n+1):
        total_sum = total_sum * i
        print(f'i = {i}, total sum = {total_sum}')

# for_factorial()

