'''
ให้เขียนโปรแกรมรับจำนวนเต็ม n จาก input 
เพื่อแสดงจำนวนเต็มคี่ตั้งแต่ 1 ถึงจำนวนคี่ที่ไม่เกิน n 
(โดยใช้วงวน while)
'''

def input_n_01():

    n = int(input('ป้อนตัวเลข: '))
    count = 1

    while count <= n:
        print(count)
        count += 2
# input_n_01()

'''
ข้อมูลที่ input มีบรรทัดแรกเป็นจำนวนเต็ม n ตามด้วยอีก n 
บรรทัดเป็นจำนวนเต็ม d0, d1, ..., dn-1 บรรทัดละจำนวน 
จงเขียนโปรแกรมอ่านข้อมูลจาก input (โดยใช้วงวน while) 
เพื่อหาผลรวมของ d0, d1, ..., dn-1
'''
def input_n_sum_n():
    n = int(input('ป้อนจำนวนครั้ง: '))
    count = 1
    total_sum = 0

    while count < n+1:
        d = int(input(f'ป้อนตัวเลข ครั้งที่ {count}: '))
        total_sum += d
        count += 1
    print(f'จำนวนครั้ง {n}, ผลรวม {total_sum}')
# input_n_sum_n()

'''
ข้อมูลจาก input เป็นจำนวนเต็ม บรรทัดละจำนวน 
จงเขียนโปรแกรมรับข้อมูลจาก input (โดยใช้วงวน while) 
เพื่อหาผลรวมของจำนวนที่อ่านเข้ามา จนพบจำนวนลบ (ไม่รวมจำนวนลบ)
'''
def input_num_n():
    total_sum = 0
    count = 1
    n = int(input(f'ป้อนตัวเลข ครั้งที่: {count}: '))

    while n > -1:
        total_sum += n
        count += 1
        n = int(input(f'ป้อนตัวเลข ครั้งที่: {count}: '))

    print(f'ผลรวม: {total_sum}')
# input_num_n()

'''
อ่านจำนวนเต็ม n จาก input แล้วเขียนคำสั่งเพื่อคำนวณและแสดงค่าของ 
∑
n
i
=
1
i
5
 (โดยใช้วงวน while)
 Sigma (ซิกม่า): คือคำสั่ง "บวก"i=1 (ตัวล่าง): คือ 
 "จุดเริ่มต้น" บอกว่าให้เริ่มนับตัวแปร i ที่เลข 1 n 
 (ตัวบน): คือ "จุดสิ้นสุด" บอกว่าให้นับไปจนถึง i
 มีค่าเท่ากับ n i^5(ตัวขวา): คือ "สิ่งที่จะนำมาบวกกัน" 
 (หรือ "สูตร") หมายความว่า "ในแต่ละรอบ ให้เอาค่า i 
 มายกกำลัง 5"เมื่อรวมกัน สูตรนี้จึงอ่านว่า:"จงบวกค่า i^5 
 โดยเริ่มตั้งแต่ i=1 ไปจนถึง =n"

 '''

def num_sum():
    n = int(input('ป้อนตัวเลข: '))
    i = 1
    total_sum = 0

    while i <= n:
        total_sum += i ** 5
        print(f'ครั้งที่ {i} รวม {total_sum}')
        i += 1
# num_sum()

'''

อ่านสตริง t จาก input เพื่อนับและแสดงว่ามีสระใน t กี่ตัว 
(นับทั้งตัวเล็กและตัวใหญ่ โดยใช้วงวน while) เช่น Anna 
มีสระเป็นจำนวน 2 ตัว แบบฝึกหัดของบทก่อน เราจำกัดขนาดของ t 
แค่ 5 ตัวอักษร แล้วก็ยังไม่ได้เรียนเรื่องวงวน ก็เขียนเป็นคำสั่งได้ดังข้างล่างนี้ 
จะเห็นว่ามีคำสั่งที่ทำงานในรูปแบบซ้ำ ๆ กัน ก็นำมาทำในวงวนได้
'''

def loop_aeiou():
    t = input("text: ")
    c = 0
    i = 0
    vowels = "aeiouAEIOU"

    while i < len(t):
        if t[i] in vowels:
            c += 1
        i += 1
    
    print(c)
# loop_aeiou()

'''
📝 5 โจทย์ฝึก while loop (สแกนข้อมูล)
1. 🔢 โจทย์: นับจำนวนตัวเลขในสตริง
สิ่งที่ต้องทำ: อ่านสตริง t จาก input (เช่น "Tel 081-234-567")

ตรรกะ: ใช้วงวน while (และตัวนับ i) วิ่งไปทีละตัวอักษร

เป้าหมาย: นับว่าในสตริง t มีอักขระที่เป็น ตัวเลข ('0' ถึง '9') ทั้งหมดกี่ตัว

คำใบ้: ป๋าใช้เมธอด .isdigit() (เช่น t[i].isdigit()) 
ภายใน if ได้เลยครับ
'''

def count_phone_number():
    phone = "Tel 081-234-567"
    i = 0
    count = 0
    number = ""

    while i < len(phone):
        if phone[i].isdigit():
            count += 1
            number += phone[i]
        i += 1
    
    print(f"Number: {number}, Count: {count}")
count_phone_number()


'''
2. 🅰️ โจทย์: นับตัวพิมพ์ใหญ่
สิ่งที่ต้องทำ: อ่านสตริง t จาก input (เช่น "Hello World")

ตรรกะ: ใช้วงวน while (และตัวนับ i) วิ่งไปทีละตัวอักษร

เป้าหมาย: นับว่าในสตริง t มีอักขระที่เป็น ตัวพิมพ์ใหญ่ (A-Z) ทั้งหมดกี่ตัว

คำใบ้: ป๋าใช้เมธอด .isupper() (เช่น t[i].isupper()) ได้ครับ
'''

def count_str_upper():
    t = "Hello World"
    i = 0
    count = 0
    word = ""

    while i < len(t):
        
        if t[i].isupper():
            word += t[i]
            count += 1
        
        i += 1

    print(f"Word: {word}, Count: {count}")

# count_str_upper()

'''
3. 🎯 โจทย์: นับอักขระที่กำหนด
สิ่งที่ต้องทำ: อ่านสตริง t จาก input (เช่น "banana") 
และรับอักขระ char_to_find อีกตัว (เช่น 'a')

ตรรกะ: ใช้วงวน while (และตัวนับ i) วิ่งไปทีละตัวอักษรใน t

เป้าหมาย: นับว่าอักขระ char_to_find ปรากฏใน t 
ทั้งหมดกี่ครั้ง (เช่น "banana" มี 'a' 3 ตัว)
'''
def count_str_find():
    t = "St. Jude Children's Research Hospital"
    i = 0
    count = 0
    char = ""
    char_to_find = "aeiou"

    while i < len(t):
        if t[i].lower() in char_to_find:
            count += 1
            
            if t[i] not in char:
                char += t[i]

        i += 1
    print(f'Char: {char}, Count: {count}')
count_str_find()

'''
. ➕ โจทย์: นับเลขบวกในลิสต์ (ใช้กับ List)
ข้อมูล (ตั้งค่าในโค้ดได้เลย): nums = [10, -5, 0, 20, -1, 3]

ตรรกะ: ใช้วงวน while (และตัวนับ i) วิ่งไปทีละช่องในลิสต์ 
nums (ใช้ while i < len(nums):)

เป้าหมาย: นับว่าในลิสต์ nums มีตัวเลขที่ มากกว่า 0 (เลขบวก) 
อยู่กี่ตัว (จากตัวอย่างคือ 3 ตัว: 10, 20, 3)
'''

def count_nums_list():
    nums = [10, -5, 0, 20, -1, 3]
    i = 0
    count = 0
    nums_deteils = []

    while i < len(nums):
        if nums[i] > 0:
            count += 1

            if nums[i] not in nums_deteils:
                nums_deteils.append(nums[i])
        
        i += 1
    
    print(f"Num: {nums_deteils}, Count: {count}")
count_nums_list()

'''
5. 🔁 โจทย์ (ท้าทาย): พิมพ์สตริงย้อนกลับ
สิ่งที่ต้องทำ: อ่านสตริง t จาก input (เช่น "Hello")

ตรรกะ: ใช้วงวน while (และตัวนับ i) วิ่งไปทีละตัวอักษร

เป้าหมาย: สร้างสตริงใหม่ (เช่น reversed_string = "") แล้วพิมพ์ผลลัพธ์ย้อนกลับ (เช่น "olleH")

คำใบ้: ในแต่ละรอบของลูป แทนที่จะบวก vowel_count ให้ป๋าเอาตัวอักษรใหม่มา "ต่อหน้า" สตริงเดิม
'''

def char_to_recversed():
    t = "Hello"
    i = 0
    reversed_string = ""

    while i < len(t):
        
        reversed_string = t[i] + reversed_string
        i += 1
    print(reversed_string)
char_to_recversed()