'''📝 5 โจทย์ฝึก for c in string
1. 🔍 โจทย์: นับอักขระเฉพาะ (Case-Insensitive Count)
Input: sentence = "Success is not final, failure is not fatal."
เป้าหมาย: จงใช้วงวน for เพื่อนับว่ามีตัวอักษร 's' หรือ 'S' ทั้งหมดกี่ตัวในประโยค
ผลลัพธ์ที่คาดหวัง: 6 ตัว'''
def check_count_s():
    
    sentence = "Success is not final, failure is not fatal."
    count_s = 0

    new_sentence = sentence.lower()

    for c in new_sentence:
        if c == 's':
            count_s += 1
        
    print('Count s =', count_s)

check_count_s()

'''2. 🔢 โจทย์: กรองเฉพาะตัวเลข (Filter Digits)
Input: text_mixed = "Product Code: P78-02A (Price: 500)"

เป้าหมาย: จงใช้วงวน for เพื่อดึงเฉพาะ ตัวเลข (Digits) ออกมาเรียงต่อกันเป็นสตริงใหม่

ผลลัพธ์ที่คาดหวัง: "7802500"

คำใบ้: ใช้ if char.isdigit(): แล้วเอาไปต่อในสตริงว่าง (new_string = new_string + char)'''
def check_digits():
    
    text_mixed = "Product Code: P78-02A (Price: 500)"
    digits = ''

    for c in text_mixed:
        if c.isdigit():
            digits += c

    print('digits =', digits)
check_digits()

'''3. ⬜ โจทย์: นับการเว้นวรรค
Input: t = "I was an assistant prevention officer"
เป้าหมาย: จงใช้วงวน for เพื่อนับว่าประโยคนี้มี ช่องว่าง (Space) ทั้งหมดกี่ตัว
คำใบ้: ตรวจสอบเงื่อนไข if char == ' ': '''
def check_space():

    t = "I was an assistant prevention officer"
    space = 0
    
    for c in t:
        if c == ' ':
            space += 1
    
    print('Space = ', space)

check_space()

'''4. 🔠 โจทย์: สร้าง Command/Slug (Transformation)
Input: title = "Database Migration Status"
เป้าหมาย: จงแปลงข้อความนี้ให้เป็น Command Format โดย 
เปลี่ยนทุกตัวอักษรให้เป็นพิมพ์ใหญ่ และ 
แทนที่ช่องว่างด้วยเครื่องหมายขีดล่าง (_)
ผลลัพธ์ที่คาดหวัง: "DATABASE_MIGRATION_STATUS"
คำใบ้: ต้องใช้ if-else (หรือ if-elif) ภายในลูป'''
def convert_str_to_upper():

    title = 'Database Migration Status'
    upper_title = title.upper()
    new_title = ''
    
    for char in upper_title:
        
        if char == ' ':
            new_title += '_'
        
        else:
            new_title += char 

    print('Title Upper _ =', new_title)

convert_str_to_upper()


'''5. ❌ โจทย์: ตรวจสอบช่องว่างในรหัสผ่าน (Boolean Flag)

Input: password = "user_01" (ลองทดสอบด้วย "user name" ด้วย)
เป้าหมาย: จงใช้วงวน for เพื่อตรวจสอบว่ารหัสผ่าน มีช่องว่างหรือไม่
ถ้า พบ ช่องว่าง ให้พิมพ์ "Invalid Password"
ถ้า ไม่พบ ช่องว่างเลย ให้พิมพ์ "Valid Password"

คำใบ้: ป๋าควรสร้างตัวแปร Boolean Flag (เช่น has_space = False) 
ไว้นอกลูป แล้วเปลี่ยนเป็น True เมื่อเจอช่องว่างครับ 
(ถ้าป๋าเรียนรู้เรื่อง break แล้ว สามารถใช้ break ได้เลย)'''

def check_password_space(password:str):

    has_space = False

    for char in password:
        
        if char == ' ':
            has_space = True 
            break
    
    if has_space:
        print('Invalid Password')
    else:
        print('Valid Password')

check_password_space(password='USER_01')
check_password_space(password='USER 01')

            
