import math


'''📝 5 โจทย์ฝึก Bisection Method (การหารากสมการ)
สำหรับแต่ละโจทย์ จงเขียนฟังก์ชัน Python def f(x): 
และ จงระบุช่วงเริ่มต้น [L, U] 
ที่มั่นใจว่ารากสมการอยู่ข้างใน (โดยต้องมีค่า f(L)
และ f(U) ที่มีเครื่องหมายต่างกัน)'''


'''
1. 🟥 โจทย์: หารากของพหุนามกำลังสอง (x^2 - 3x - 4)
'''
def f01(x:float):
    return pow(x, 2) - 3*x - 4

'''
2. 🌲 โจทย์: หารากที่สามของสิบ (x^3 - 10)
'''
def f02(x:float):
    return pow(x, 3) - 10

'''
3. ⏱️ โจทย์: หารากของสมการตรีโกณมิติ (cos(x) - x)
'''
def f03(x:float):
    return (math.cos(x) - x)

'''
4. 📈 โจทย์: หารากของสมการกำลังสี่ (x^4 + 2x^3 - x - 1)
'''
def f04(x:float):
    return pow(x, 4) + 2 * pow(x, 3) - x - 1

'''
5. 💡 โจทย์: หารากของฟังก์ชันเลขชี้กำลัง (e^x - 3x)
'''
def f05(x:float):
    return math.exp(x) - 3*x


'''🛠️ โครงสร้าง Bisection ฉบับสมบูรณ์'''

def solve_bisection(L, U, x_target):
    # L และ U คือช่วงเริ่มต้น
    # x_target คือค่าที่โจทย์ต้องการ

    # ใช้ 1e-6 (1 x 10^-6) เป็นค่าความคลาดเคลื่อน (epsilon)

    # ใช้เงื่อนไขหยุดลูปที่ป๋าเขียนไว้ก่อนหน้า
    while abs(L-U) > 1e-6: # อาจใช้ while abs(L-U) > 1e-6 ก็ได้
        
        r = (L + U) / 2
        f_r = f01(r)

        # ตรวจสอบเครื่องหมาย
        if f_r > 0:
            U = r
        else:
            L = r
    result = (L+U) / 2
    print(f'รากของสมการคือ: {result:.6f}')

solve_bisection(L=3, U=5, x_target=4)

