'''
1. 🧮 โจทย์ตรวจเลขคู่-คี่ (Odd/Even)
สิ่งที่ต้องรับ (Input): รับตัวเลขจำนวนเต็ม 1 ตัว
สิ่งที่ต้องแสดงผล (Output): พิมพ์ว่า "เลขคู่" (Even) ถ้าเลขนั้นหาร 2 ลงตัว หรือ "เลขคี่" (Odd) ถ้าหาร 2 ไม่ลงตัว

'''
def odd_even(num: int) -> int:
    if num % 2 == 0:
        return f'{num} เป็น: เลขคู่'
    else:
        return f'{num} เป็น: เลขคี่'

def call_odd_even():
    print(odd_even(11))
    print(odd_even(12))
    print(odd_even(13))
    print(odd_even(14))
# call_odd_even()

'''
2. 🎓 โจทย์สอบผ่าน/สอบตก (Pass/Fail)
สิ่งที่ต้องรับ (Input): รับคะแนนสอบ (ตัวเลข)

สิ่งที่ต้องแสดงผล (Output): ถ้าคะแนน ตั้งแต่ 50 ขึ้นไป ให้พิมพ์ 
สอบผ่าน" (Pass) นอกเหนือจากนั้น ให้พิมพ์ "สอบตก" (Fail)
'''
def pass_fail(score: int) -> str:
    if score > 50:
        return f'คะแนน {score} "สอบผ่าน"'
    else:
        return f'คะแนน {score} "สอบไม่ผ่าน"'
    
def call_pass_fail():
    print(pass_fail(49))
    print(pass_fail(50))
    print(pass_fail(51))
# call_pass_fail()


'''
3. ➕➖ โจทย์ตรวจสอบเครื่องหมาย (Positive/Negative/Zero)
สิ่งที่ต้องรับ (Input): รับตัวเลข 1 ตัว
สิ่งที่ต้องแสดงผล (Output):
ถ้าเลข มากกว่า 0 ให้พิมพ์ "จำนวนบวก"
ถ้าเลข น้อยกว่า 0 ให้พิมพ์ "จำนวนลบ"
ถ้าเลข เท่ากับ 0 ให้พิมพ์ "ศูนย์"
'''

def positive_negative_zero(num: int) -> str:
    if num == 0:
        return f'{num} is: Zero'
    elif num > 0:
        return f'{num} is: Positive'
    else:
        return f'{num} is: Negative'
    
def call_positive_negative_zero():
    print(positive_negative_zero(-1))
    print(positive_negative_zero(0))
    print(positive_negative_zero(1))

# call_positive_negative_zero()

'''
4. 🌡️ โจทย์วัดอุณหภูมิ (Temperature Check)
สิ่งที่ต้องรับ (Input): รับอุณหภูมิ (ตัวเลข)
สิ่งที่ต้องแสดงผล (Output):
ถ้าอุณหภูมิ มากกว่า 30 พิมพ์ "อากาศร้อน" (Hot)
ถ้าอุณหภูมิ อยู่ระหว่าง 20 ถึง 30 (รวม 20 และ 30 ด้วย) พิมพ์ "อากาศอบอุ่น" (Warm)
ถ้านอกเหนือจากนั้น พิมพ์ "อากาศหนาว" (Cold)
'''
def temp_check(temp: int) -> str:
    if temp > 30:
        return f'อุณหภูมิ {temp} อากาศร้อน '
    elif 20 <= temp <= 30:
        return f'อุณหภูมิ {temp} อากาศอบอุ่น'
    else:
        return f'อุณหภูมิ {temp} อากาศหนาว'
    
def call_temp_check():
    print(temp_check(31))
    print(temp_check(30))
    print(temp_check(25))
    print(temp_check(20))
    print(temp_check(19))
    print(temp_check(0))
# call_temp_check()

'''
5. 🅰️ โจทย์ตัดเกรด (Grading)
สิ่งที่ต้องรับ (Input): รับคะแนนสอบ (0-100)
สิ่งที่ต้องแสดงผล (Output):
80 - 100 พิมพ์ "Grade A"
70 - 79 พิมพ์ "Grade B"
60 - 69 พิมพ์ "Grade C"
50 - 59 พิมพ์ "Grade D"
ต่ำกว่า 50 พิมพ์ "Grade F"
'''
def grading(score: int)-> str:
    if score >= 80:
        return f'Score {score} Grade A'
    elif score >= 70:
        return f'Score {score} Grade B'
    elif score >= 60:
        return f'Score {score} Grade C'
    elif score >= 50:
        return f'Score {score} Grade D'
    else:
        return f'Score {score} Grade F'
    
def call_grading():
    print(grading(100))
    print(grading(80))
    print(grading(79))
    print(grading(70))
    print(grading(69))
    print(grading(60))
    print(grading(59))
    print(grading(50))
    print(grading(49))
    print(grading(9))
# call_grading()


