import random 

'''
1. 🚚 โจทย์คำนวณค่าขนส่ง (Nested if)
สิ่งที่ต้องรับ (Input):
total_purchase (int): ยอดซื้อรวม
location (str): ที่อยู่ ("BKK" หรือ "Upcountry")
ตรรกะ:
ถ้า ยอดซื้อ มากกว่า 2,000 บาท -> ส่งฟรี (พิมพ์ "ค่าส่ง: 0 บาท")
นอกเหนือจากนั้น (ยอดซื้อ <= 2000):
ให้เช็กต่อว่า: ถ้า ที่อยู่เป็น "BKK" -> ค่าส่ง 50 บาท
นอกเหนือจากนั้น (ที่อยู่เป็น "Upcountry") -> ค่าส่ง 80 บาท
สิ่งที่ต้องแสดงผล (Output): ค่าส่งที่คำนวณได้
'''

def delivery(total_purchase: int, location: str) -> str:
    
    if total_purchase > 2000:
        return f'ยอดสั่งซื้อ {total_purchase} ส่งที่ {location} ส่งฟรี '
    
    else:
        if location == 'bkk':
            return f'ยอดสั่งซื้อ {total_purchase} ส่งที่ {location} ค่าส่ง 50 บาท '
        else:
            return f'ยอดสั่งซื้อ {total_purchase} ส่งที่ {location} ค่าส่ง 80 บาท '

def call_delivery() -> None:

    for item in range(1,11):
        total_purchase = random.randint(1500,2500)
        location = random.choice(['bkk','upcountry'])
        print(item,delivery(total_purchase=total_purchase, location=location))
# call_delivery()

'''
2. 🏦 โจทย์ตรวจสอบสิทธิ์เข้า ATM (Nested if 2 ชั้น)
สิ่งที่ต้องรับ (Input):
pin_correct (bool): รหัส PIN ถูกต้องหรือไม่ (True หรือ False)
balance (int): ยอดเงินคงเหลือ
withdraw_amount (int): จำนวนเงินที่ต้องการถอน
ตรรกะ: (เช็กทีละด่าน)
ถ้า pin_correct เป็น True:
ให้เช็กด่าน 2: ถ้า withdraw_amount น้อยกว่าหรือเท่ากับ balance:
ให้เช็กด่าน 3: ถ้า withdraw_amount ต้องหาร 100 ลงตัว (เช่น 500, 1000 แต่ถอน 150 ไม่ได้)
พิมพ์ "ถอนสำเร็จ ยอดเงินคงเหลือ X บาท" (X คือยอดใหม่)
นอกนั้น (ด่าน 3): พิมพ์ "โปรดระบุจำนวนเงินเป็นหลักร้อย"
นอกนั้น (ด่าน 2): พิมพ์ "ยอดเงินไม่เพียงพอ"
นอกนั้น (ด่าน 1): พิมพ์ "รหัส PIN ไม่ถูกต้อง"
สิ่งที่ต้องแสดงผล (Output): ข้อความตามเงื่อนไขข้อใดข้อหนึ่ง
'''
def atm_check(pin: bool, balance: int, withdrow_amount: int) -> str:

    if pin:
        print('เข้าสู่ระบบเรียบร้อย')
        print(f'ยอดเงินคงเหลือ {balance:,.2f}')

        if withdrow_amount % 100 == 0:

            if withdrow_amount <= balance:
                total_balance = balance - withdrow_amount
                return f'ถอนเงิน:{withdrow_amount:,.2f} บาท, สำเร็จแล้ว เงินคงเหลือ: {total_balance:,.2f} บาท'
            
            else:
                return f'ยอดเงินไม่เพียงพอ, ถอนเงิน: {withdrow_amount:,.2f} บาท, เงินคงเหลือ: {balance:,.2f} บาท'
            
        else:
            return f'โปรดระบุจำนวนเงินเป็นหลักร้อย, ถอนเงิน {withdrow_amount:,.2f} บาท'
        
    else:
        return 'รหัส pin ไม่ถูกต้อง'    

def call_atm_check() -> None:

    for person in range(1,11):
        
        pin = random.choice([True,False])
        balance = random.randint(100,2000,)
        withdrow_amount = random.randrange(50,3000,25)

        print(f'คนที่ {person}. {atm_check(pin=pin, balance=balance,
                                     withdrow_amount=withdrow_amount)}')
        print('-' * 30)
call_atm_check()

'''
3. 🎓 โจทย์รับสมัครนักศึกษา (Complex elif)
สิ่งที่ต้องรับ (Input):
gpa (float): เกรดเฉลี่ย
interview_score (int): คะแนนสอบสัมภาษณ์ (เต็ม 10)
ตรรกะ:
ถ้า gpa มากกว่า 3.8 -> พิมพ์ "ผ่าน (โควต้าเรียนดี)"
ถ้าไม่ (elif) gpa มากกว่า 3.5 และ interview_score ตั้งแต่ 8 ขึ้นไป -> พิมพ์ "ผ่าน (โควต้าสัมภาษณ์)"
ถ้าไม่ (elif) gpa มากกว่า 3.0 และ interview_score เท่ากับ 10 -> พิมพ์ "ผ่าน (พิจารณาพิเศษ)"
นอกเหนือจากนั้นทั้งหมด -> พิมพ์ "ไม่ผ่าน"
สิ่งที่ต้องแสดงผล (Output): ผลการคัดเลือก
'''
def gpa_check(gpa:float, intview_score:int) -> str:
    
    if gpa > 3.8:
        return f'ผ่าน (โคต้าเรียนดี), GPA {gpa:.2f}'
    
    elif gpa > 3.5 and intview_score >= 8:
        return f'ผ่าน (โคต้าสัมภาษณ์), GPA {gpa:.2f}, Interview {intview_score}'
    
    elif gpa > 3.0 and intview_score == 10:
        return f'ผ่าน (พิจารณาพิเศษ), GPA {gpa:.2f}, Interview {intview_score}'
    
    else:
        return f'ไม่ผ่าน, GPA {gpa:.2f}, Interview {intview_score}'

def call_gpa_check() -> None:

    for studene in range(1,11):

        gpa = random.uniform(3.0,4.0)
        interview_score = random.randrange(5,11)

        print(f'นักเรียนคนที่: {studene} {gpa_check(gpa=gpa, intview_score=interview_score)}')
        print('-' * 60)
# call_gpa_check()

'''
4. 🍽️ โจทย์ส่วนลดร้านอาหาร (Complex and/or)
สิ่งที่ต้องรับ (Input):
day (str): วันที่ ("Weekday" หรือ "Weekend")
is_member (bool): เป็นสมาชิกหรือไม่ (True หรือ False)
total_bill (int): ยอดบิลรวม
ตรรกะ: ร้านจะให้ส่วนลด 15% ถ้าเข้าเงื่อนไขข้อใดข้อหนึ่งต่อไปนี้:
เป็นวัน "Weekday" และ ยอดบิล มากกว่า 500
หรือ เป็น is_member (True)
สิ่งที่ต้องแสดงผล (Output):
ถ้าได้ลด: พิมพ์ "คุณได้รับส่วนลด 15%"
ถ้าไม่ได้ลด: พิมพ์ "คุณไม่ได้รับส่วนลด"
คำใบ้: ป๋าอาจจะต้องใช้วงเล็บ () ครอบเงื่อนไข and เพื่อให้ or ทำงานถูกต้อง
'''
def restaurant(day: str, is_member: bool, total_bill: int) -> str:
    
    if (day == 'Weekday' and total_bill > 500) or is_member:
        return f'คุณได้รับส่วนลด 15%, วัน {day}, ราคา {total_bill} is member {is_member}'
    else:
        return f'คุณไม่ได้รับส่วนลด, วัน {day}, ราคา {total_bill} is member {is_member}'
    
def call_restaurant() -> None:

    for bill in range(1,11):
        day = random.choice(['Weekday', 'Weekend'])
        is_member = random.choice([True, False])
        total_bill = random.randint(300,600)

        print(f'Bill {bill}. {restaurant(day=day, is_member=is_member, total_bill=total_bill)}')
        print('-' * 60)
# call_restaurant()

'''
5. 🥇 โจทย์หาค่ามากที่สุด (จาก 3 ตัวเลข)
สิ่งที่ต้องรับ (Input): รับตัวเลข 3 ตัว a, b, c
ตรรกะ:
ถ้า a มากกว่าหรือเท่ากับ b และ a มากกว่าหรือเท่ากับ c -> a คือค่ามากสุด
ถ้าไม่ (elif) b มากกว่าหรือเท่ากับ a และ b มากกว่าหรือเท่ากับ c -> b คือค่ามากสุด
นอกเหนือจากนั้น -> c คือค่ามากสุด
สิ่งที่ต้องแสดงผล (Output): พิมพ์ "ค่ามากที่สุดคือ X" (X คือ a, b, หรือ c)
'''
def max_total(a:int, b:int, c:int) -> str:



    if b <= a >= c:
        return f'A มากสุด, A:{a}, B:{b}, C:{c}'
    
    elif a <= b >= c:
        return f'B มากสุด, A:{a}, B:{b}, C:{c}'
    
    else:
        return f'C มากสุด, A:{a}, B:{b}, C:{c}'
    
def call_max_total():

    for max in range(10):
        a = random.randint(1,1000)
        b = random.randint(1,1000)
        c = random.randint(1,1000)

        print(max,'.',max_total(a=a, b=b, c=c)) 
        print('-' * 60)
# call_max_total()

        
