import random
'''
1. 🧮 โจทย์ตรวจเลขคู่-คี่ (Odd/Even)
สิ่งที่ต้องรับ (Input): รับตัวเลขจำนวนเต็ม 1 ตัว
สิ่งที่ต้องแสดงผล (Output): พิมพ์ว่า "เลขคู่" (Even) ถ้าเลขนั้นหาร 2 ลงตัว หรือ "เลขคี่" (Odd) ถ้าหาร 2 ไม่ลงตัว

'''
def odd_even(num: int) -> int:
    if num % 2 == 0:
        return f'{num} เป็น: เลขคู่'
    else:
        return f'{num} เป็น: เลขคี่'

def call_odd_even():
    print(odd_even(11))
    print(odd_even(12))
    print(odd_even(13))
    print(odd_even(14))
# call_odd_even()

'''
2. 🎓 โจทย์สอบผ่าน/สอบตก (Pass/Fail)
สิ่งที่ต้องรับ (Input): รับคะแนนสอบ (ตัวเลข)

สิ่งที่ต้องแสดงผล (Output): ถ้าคะแนน ตั้งแต่ 50 ขึ้นไป ให้พิมพ์ 
สอบผ่าน" (Pass) นอกเหนือจากนั้น ให้พิมพ์ "สอบตก" (Fail)
'''
def pass_fail(score: int) -> str:
    if score >= 50:
        return f'คะแนน {score} "สอบผ่าน"'
    else:
        return f'คะแนน {score} "สอบไม่ผ่าน"'
    
def call_pass_fail():
    print(pass_fail(49))
    print(pass_fail(50))
    print(pass_fail(51))
# call_pass_fail()


'''
3. ➕➖ โจทย์ตรวจสอบเครื่องหมาย (Positive/Negative/Zero)
สิ่งที่ต้องรับ (Input): รับตัวเลข 1 ตัว
สิ่งที่ต้องแสดงผล (Output):
ถ้าเลข มากกว่า 0 ให้พิมพ์ "จำนวนบวก"
ถ้าเลข น้อยกว่า 0 ให้พิมพ์ "จำนวนลบ"
ถ้าเลข เท่ากับ 0 ให้พิมพ์ "ศูนย์"
'''

def positive_negative_zero(num: int) -> str:
    if num == 0:
        return f'{num} is: Zero'
    elif num > 0:
        return f'{num} is: Positive'
    else:
        return f'{num} is: Negative'
    
def call_positive_negative_zero():
    print(positive_negative_zero(-1))
    print(positive_negative_zero(0))
    print(positive_negative_zero(1))

# call_positive_negative_zero()

'''
4. 🌡️ โจทย์วัดอุณหภูมิ (Temperature Check)
สิ่งที่ต้องรับ (Input): รับอุณหภูมิ (ตัวเลข)
สิ่งที่ต้องแสดงผล (Output):
ถ้าอุณหภูมิ มากกว่า 30 พิมพ์ "อากาศร้อน" (Hot)
ถ้าอุณหภูมิ อยู่ระหว่าง 20 ถึง 30 (รวม 20 และ 30 ด้วย) พิมพ์ "อากาศอบอุ่น" (Warm)
ถ้านอกเหนือจากนั้น พิมพ์ "อากาศหนาว" (Cold)
'''
def temp_check(temp: int) -> str:
    if temp > 30:
        return f'อุณหภูมิ {temp} อากาศร้อน '
    elif 20 <= temp <= 30:
        return f'อุณหภูมิ {temp} อากาศอบอุ่น'
    else:
        return f'อุณหภูมิ {temp} อากาศหนาว'
    
def call_temp_check():
    print(temp_check(31))
    print(temp_check(30))
    print(temp_check(25))
    print(temp_check(20))
    print(temp_check(19))
    print(temp_check(0))
# call_temp_check()

'''
5. 🅰️ โจทย์ตัดเกรด (Grading)
สิ่งที่ต้องรับ (Input): รับคะแนนสอบ (0-100)
สิ่งที่ต้องแสดงผล (Output):
80 - 100 พิมพ์ "Grade A"
70 - 79 พิมพ์ "Grade B"
60 - 69 พิมพ์ "Grade C"
50 - 59 พิมพ์ "Grade D"
ต่ำกว่า 50 พิมพ์ "Grade F"
'''
def grading(score: int)-> str:
    if score >= 80:
        return f'Score {score} Grade A'
    elif score >= 70:
        return f'Score {score} Grade B'
    elif score >= 60:
        return f'Score {score} Grade C'
    elif score >= 50:
        return f'Score {score} Grade D'
    else:
        return f'Score {score} Grade F'
    
def call_grading():
    print(grading(100))
    print(grading(80))
    print(grading(79))
    print(grading(70))
    print(grading(69))
    print(grading(60))
    print(grading(59))
    print(grading(50))
    print(grading(49))
    print(grading(9))
# call_grading()

'''
6. 🧑‍💻 โจทย์ตรวจสอบการล็อกอิน (Login)
สิ่งที่ต้องรับ (Input): รับ username 1 ครั้ง และ password 1 ครั้ง
สิ่งที่ต้องแสดงผล (Output):
ถ้า username คือ "admin" และ password คือ "pass123" ให้พิมพ์ "ล็อกอินสำเร็จ"
นอกเหนือจากนั้น ให้พิมพ์ "ชื่อผู้ใช้หรือรหัสผ่านผิด"
'''
def user_login(user: str, pwd: str) -> str:
    if user == 'admin' and pwd == 'pass123':
        return f'ล๊อกอินสำเร็จ, ยินดีตอนรับ คุณ{user}'
    else:
        return f'ชื่อผู้ใช้หรือรหัสผ่านผิด'

def call_user_login():
    print(user_login('admin','pass'))
    print(user_login('amin','pass123'))
    print(user_login('admin','pass123'))
# call_user_login()

'''
7. 🗓️ โจทย์ตรวจสอบวันหยุด (Weekend Check)
สิ่งที่ต้องรับ (Input): รับชื่อวันของสัปดาห์ (เช่น "Monday", "Sunday")
สิ่งที่ต้องแสดงผล (Output):
ถ้าเป็น "Saturday" หรือ "Sunday" ให้พิมพ์ "วันหยุด" (Weekend)
นอกเหนือจากนั้น ให้พิมพ์ "วันทำงาน" (Weekday)
เคล็ดลับ Pythonic: ลองนึกถึงการใช้ in ที่เราเคยทำในโจทย์เรื่องเดือนดูครับ
'''
def weekend_check(day: str) -> str:
    if day in ['saturday', 'sunday']:
        return f'{day} Weekend วันหยุด'
    else:
        return f'{day} Weekday วันทำงาน'

def call_weekend_check():
    days = ['monday', 'tuesday', 'wednesday',
        'thursday', 'friday', 'saturday',  'sunday']
    
    random_days = random.choice(days)

    for i in range(1,6):
        print(f'{i}. {weekend_check(random_days)}')

# call_weekend_check()

'''
8. 🎟️ โจทย์คำนวณค่าตั๋ว (Ticket Price)
สิ่งที่ต้องรับ (Input): รับอายุ (Age)
สิ่งที่ต้องแสดงผล (Output):
ถ้าอายุ น้อยกว่า 5 ปี พิมพ์ "ราคา: เข้าฟรี"
ถ้าอายุ 5 ถึง 18 ปี พิมพ์ "ราคา: 100 บาท"
ถ้าอายุ มากกว่า 18 ปี พิมพ์ "ราคา: 200 บาท"
'''
def ticket_price(age: int) -> str:
    if age >= 18:
        return 'บัตรราคา 200 บาท'
    elif age >= 5:
        return 'บัตรราคา 100 บาท'
    else:
        return 'บัตรราคา เข้าฟรี'
    
def call_ticket_price():
    age = random.randint(1,20)
    print(ticket_price(age))
    print(ticket_price(age))
    print(ticket_price(age))
    print(ticket_price(age))
# call_ticket_price()

'''
9. 💸 โจทย์คำนวณส่วนลด (Discount)
สิ่งที่ต้องรับ (Input): รับยอดซื้อ (Amount) และสถานะสมาชิก (เช่น "Yes" หรือ "No")
สิ่งที่ต้องแสดงผล (Output):
ถ้า ยอดซื้อ มากกว่า 1,000 บาท และ เป็นสมาชิก ("Yes") ให้พิมพ์ "คุณได้รับส่วนลด 10%"
นอกเหนือจากนั้น ให้พิมพ์ "ไม่ได้รับส่วนลด"
'''
def discount(amount: int, members: str) -> str:
    
    if amount > 1000 and members == 'yes':
        discount_member = amount * 10 / 100
        total_amount = amount - discount_member
        return f'ยอดเงิน {amount} บาท และเป็นสมาชิกได้รับส่วนลด 10% เป็นเงิน {total_amount} บาท'
    else:
        return f'ยอดเงิน {amount} บาท ไม่ได้รับส่วนลด'
    
def call_discount():
    amount = random.randint(900,2000)
    member = random.choice(['yes', 'no'])
    sales = discount(amount=amount,members=member)
    print(sales)
# call_discount()


'''
10. 🐝 โจทย์ FizzBuzz (ฉบับย่อ)
สิ่งที่ต้องรับ (Input): รับตัวเลขจำนวนเต็ม 1 ตัว
สิ่งที่ต้องแสดงผล (Output):
ถ้าเลขนั้นหาร 3 ลงตัว และ หาร 5 ลงตัว ให้พิมพ์ "FizzBuzz"
ถ้าเลขนั้นหาร 3 ลงตัว (อย่างเดียว) ให้พิมพ์ "Fizz"
ถ้าเลขนั้นหาร 5 ลงตัว (อย่างเดียว) ให้พิมพ์ "Buzz"
ถ้านอกเหนือจากนั้น ให้พิมพ์ตัวเลขนั้นกลับออกมา
'''
def fizzbuzz(num: int) -> str:
    if num % 3 == 0 and num % 5 == 0:
        return f'{num} FizzBuzz'
    
    elif num % 3 == 0:
        return f'{num} Fizz'
    
    elif num % 5 == 0:
        return f'{num} Buzz'
    
    else:
        return num

def call_fizzbuzz():
    num = random.randint(1000, 20000)
    print(fizzbuzz(num=num))
call_fizzbuzz()