# อ่านจำนวนเต็มจาก input มาเก็บใน m
# อ่านจำนวนเต็มจาก input มาเก็บใน k
# นำค่าใน k ไปเพื่มให้กับตัวแปร m

m = int(input("ป้อน m (จำนวนเต็ม): "))
k = int(input('ป้อน k (จำนวนเต็ม): '))

m += k
print(f'ผลลัพธ์ m ใหม่คือ: {m}')

# # อ่านสตริงจาก input เก็บใน s
# # อ่านสตริงจาก input เก็บใน t
# # นำสตริงใน t ไปต่อทางขวาของ s

s = input('ป้อน s (สตริง): ')
t = input('ป้อน t (สตริง): ')
s = s+t
print(f'ผลลัพธ์ s ใหม่คือ: {s}')

# อ่านจำนวนจริงจาก input มาเก็บใน d
#    d เป็นมุม หน่วยเป็นองศา
# ให้ r เก็บค่ามุมหน่วยเรเดียนที่แปลงจาก d
# ให้ x เก็บค่า sin( r )
# ให้ y เก็บค่าเดียวกับ x 
#    แต่ปัดเศษให้มีเลขหลังจุดทศนิยม 2 ตำแหน่ง
#

import math
d = float(input('ป้อน d (มุมองศา): '))

r = math.radians(d)

x = math.sin(r)

y = round(x, 2)

print(f'มุมเรเดียน (r): {r}')
print(f'ค่า sin(r): {x}')
print(f'ปัดเศษ 2 ตำแหน่ง (y): {y}')
