'''
x = 23.456

y = [4,5,6]

# นำค่าใน x มาแปลงให้เป็นสตริง

# เอาไปต่อด้วยสตริงที่ได้จาก

# การนำค่าใน y มาแปลงให้เป็นสตริง 

# เก็บผลลัพธืในตัวแปร t 

#
'''
x = 23.456
y = [4, 5, 6]

# แบบธรรมดา
# str_x = str(x)

# str_y = str(y)

# t = str_x + str_y

# print(t)      

# แบบ pythonic
# แปลง x เป็นสตริง
str_x = str(x)

# 2. แปลง "สมาชิก" ทุกตัวใน y เป็นสตริง แล้ว "นำมาต่อกัน"
# map(str, y) จะเปลี่ยน [4, 5, 6] เป็น ['4', '5', '6']
# "".join(...) จะนำสมาชิกใน list มารวมกันเป็นสตริงเดียว

str_y_joined = ''.join(map(str, y))

# 3 ต่อผลลัพธ์
t = str_x + str_y_joined

print(t)

