'''
📘 บทฝึก: Nested List (ตาราง 2 มิติ)

ข้อมูลตั้งต้น:
table = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

โจทย์ทั้งหมดด้านล่าง ใช้ข้อมูล table นี้
========================================
'''

table = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]


'''
🧩 ข้อที่ 1: อ่านค่าทุกช่องในตาราง

จงเขียนฟังก์ชันพิมพ์ตัวเลขทุกตัวใน table
ออกมาทีละบรรทัด (จากซ้ายไปขวา บนลงล่าง)

ผลลัพธ์ที่ต้องได้:
1
2
3
4
5
6
7
8
9
'''
# โค๊ดแบบอ้าง index[i]
def print_all(table):
    for i in range(len(table)):

        for j in range(len(table[i])):
            print(table[i][j])
        # print()
# print_all(table)

def print_all_pythonic(table):
    for row in table:
        for value in row:
            print(value)
# print_all_pythonic(table)


'''
🧩 ข้อที่ 2: พิมพ์ตารางตามรูปแบบ

จงพิมพ์ table ให้อยู่ในรูปตารางเหมือนข้อมูลเดิม

ผลลัพธ์ที่ต้องได้:
1 2 3
4 5 6
7 8 9
'''
# basic pythonic
def print_table(table):
    for row in table:
        for value in row:
            print(value, end=' ')
        print()
# print_table(table)

# pythonic more than
def print_table2(table):
    for row in table:
        print(*row)
print_table(table)


'''
🧩 ข้อที่ 3: เข้าถึงค่ากลางตาราง

จงพิมพ์ค่าที่อยู่ตรงกลางของ table

ผลลัพธ์ที่ต้องได้:
5
'''
# สูตรหาตรงกลาง นับแถว // 2 นับคอลัม // 2
def print_center(table):
    mid_row = len(table) // 2
    mid_col = len(table[0]) // 2
    print(table[mid_row][mid_col])
print_center(table)


'''
🧩 ข้อที่ 4: หาผลรวมของแต่ละแถว

จงพิมพ์ผลรวมของตัวเลขในแต่ละแถว (ทีละบรรทัด)

ผลลัพธ์ที่ต้องได้:
6
15
24
'''
# เขียนแบบธรรมดา
def sum_each_row(table):
    for row in table:
        total = 0
        for val in row:
            total += val
        print(total)
# sum_each_row(table)

# pythonic style
def sum_each_row_1(table):
    for row in table:
        print(sum(row))
# sum_each_row_1(table)


'''
🧩 ข้อที่ 5: รวมค่าทั้งตาราง

จงเขียนฟังก์ชันคืนค่าผลรวมของตัวเลขทั้งหมดใน table

ผลลัพธ์ที่ต้องได้:
45
'''
# basic python
def sum_all(table):
    total = 0
    for row in table:
        for val in row:
            total += val
    return total
# print(sum_all(table))

# pythonic style
def sum_all_1(table):
    total = 0
    for row in table:
        total += sum(row)
    return total
print(sum_all_1(table))
