'''แบบฝึกหัด 9-1 การเยื้องข้อความออก
จงเขียนโปรแกรมรับจำนวนเต็มบวก 𝑛
n และแสดงข้อความตามรูปแบบต่อไปนี้
โดยให้แต่ละบรรทัดเยื้องไปทางขวาเพิ่มขึ้นทีละหนึ่งช่องว่าง
และมีเครื่องหมาย * จำนวนเท่ากับหมายเลขบรรทัด'''

# nested_loop แบบ pythonic
def nested_loop(n:int):
    for i in range(1, n+1):
        # space = '-' * (i - 1)
        # star = '*' * i
        # print(space + star)

        print(' '*(i-1) + '*' * i)

nested_loop(4)


def nested_loop_basic(n:int):
    for i in range(1, n+1):
        for k in range(i - 1):
            print(' ', end='')
        for k in range(i):
            print('*', end='')
        print()
nested_loop_basic(9)