'''📝 5 โจทย์ฝึก Parallel Lists & Search Flag
1. 🎓 โจทย์: รายชื่อคนสอบตก
สถานการณ์: ครูต้องการหารายชื่อนักเรียนที่ได้คะแนน น้อยกว่า 50 (สอบตก)

Input:
บรรทัดแรก: ชื่อนักเรียน (คั่นด้วยช่องว่าง)
บรรทัดสอง: คะแนนสอบ (คั่นด้วยช่องว่าง)
Process: วนลูปเช็กคะแนน ถ้าคะแนน < 50 ให้พิมพ์ชื่อคนนั้น
Output: ชื่อนักเรียนที่สอบตก (บรรทัดละคน) ถ้าไม่มีเลยให้พิมพ์ "Pass all"z'''
def check_student_pass(name:str, score_str:str, score:str):
    name = name.split()
    score_list = score_str.split()
    score_pass = float(score)
    is_result = False

    for i in range(len(name)):
        if float(score_list[i]) < score_pass:
            print(name[i])
            is_result = True
    
    if not is_result:
        print('Pass all')

name = 'นันฐนัท พงศกร นนทพัน'
score_str = '10 1 2'
score = '50'
# check_student_pass(name=name, score_str=score_str, score=score)

'''2. 📦 โจทย์: สินค้าใกล้หมดสต็อก
สถานการณ์: เจ้าของร้านต้องการรู้ว่าสินค้าไหนเหลือ น้อยกว่า 10 ชิ้น จะได้สั่งเพิ่ม
Input:
บรรทัดแรก: ชื่อสินค้า
บรรทัดสอง: จำนวนคงเหลือ (Stock)
Process: วนลูปเช็กจำนวน ถ้า Stock < 10 ให้พิมพ์ชื่อสินค้า
Output: ชื่อสินค้าที่ต้องสั่งเพิ่ม ถ้าไม่มีเลยให้พิมพ์ "Stock OK"'''

def check_stock(name:str, qproduct:str):
    list_name = name.split()
    list_qproduct = qproduct.split()
    is_stock = False

    for i in range(len(list_name)):
         if float(list_qproduct[i]) < 10:
             print('สินค้าเหลือ < 10 =', list_name[i], list_qproduct[i])
             is_stock = True
    
    if not is_stock:
        print('"Stock OK"')

name = 'ขนม นม น้า กาแฟ'
qproduct = '10 10 10 10'

check_stock(name=name, qproduct=qproduct)

'''3. 🚗 โจทย์: กล้องตรวจจับความเร็ว
สถานการณ์: ตำรวจต้องการหาทะเบียนรถที่ขับ เร็วกว่า 120 km/h
Input:
บรรทัดแรก: เลขทะเบียนรถ
บรรทัดสอง: ความเร็วที่วัดได้
Process: วนลูปเช็กความเร็ว ถ้า Speed > 120 ให้พิมพ์เลขทะเบียน
Output: เลขทะเบียนรถที่ทำผิดกฎ ถ้าไม่มีเลยให้พิมพ์ "No violation"'''

def check_speed_car(vehicle_re:str, speed:str):
    vehicle_re = vehicle_re.split()
    speed = speed.split()
    is_speed = False

    for i in range(len(vehicle_re)):
        if float(speed[i]) > 120:
            print(vehicle_re[i])
            is_speed = True
    
    if not is_speed:
        print('No violation')

vehicle_re = 'กค1234 หฟ4321 สส4567 ยว9874'
speed = '120 12 12 10'
check_speed_car(vehicle_re=vehicle_re, speed=speed)

'''4. 🌡️ โจทย์: แจ้งเตือนอากาศร้อนจัด
สถานการณ์: กรมอุตุฯ ต้องการประกาศชื่อจังหวัดที่มีอุณหภูมิ ตั้งแต่ 40 องศาขึ้นไป
Input:
บรรทัดแรก: ชื่อจังหวัด
บรรทัดสอง: อุณหภูมิ (องศาเซลเซียส)
Process: วนลูปเช็กอุณหภูมิ ถ้า Temp >= 40 ให้พิมพ์ชื่อจังหวัด
Output: ชื่อจังหวัดที่ร้อนจัด ถ้าไม่มีเลยให้พิมพ์ "No extreme heat"'''
def check_temp(jangwat:str, temp:str):
    jangwat = jangwat.split()
    temp = temp.split()
    hot_temp = False

    for i in range(len(jangwat)):
        if float(temp[i]) >= 40:
            print(jangwat[i])
            hot_temp = True

    if not hot_temp:
        print('No extreme heat')

jangwat = 'มุกดาหาร กรุงเทพ ภูเก็ต เชียงใหม่'
temp = '20 30 30 18'
check_temp(jangwat=jangwat, temp=temp)


'''5. 🎬 โจทย์: ค้นหาหนังตามความยาว (หน่วยนาที)
สถานการณ์: ป๋าอยากดูหนังแต่มีเวลาน้อย อยากหาหนังที่ความยาว ไม่เกิน 100 นาที
Input:
บรรทัดแรก: ชื่อหนัง
บรรทัดสอง: ความยาวหนัง (นาที)
Process: วนลูปเช็กความยาว ถ้า Duration <= 100 ให้พิมพ์ชื่อหนัง
Output: ชื่อหนังที่ดูทัน ถ้าไม่มีเลยให้พิมพ์ "No short movies"'''

def check_movies(movies:str, duration:str):
    movies = movies.split()
    duration = duration.split()
    is_short = False

    for i in range(len(movies)):
        if float(duration[i]) <= 100:
            print(movies[i])
            is_short = True
    
    if not is_short:
        print('No short movies')

movies = 'แฟนฉัน โกยเถอะโยม เจ็ดประจันบาน'
duration = '80 20 10'
check_movies(movies=movies, duration=duration)