'''
📝 โจทย์ฝึก List Methods (3 ข้อ)
ข้อ 1: ระบบคิวธนาคาร (Append & Pop)
สร้าง List ว่าง queue = []
ลูกค้ามา 3 คน: "A", "B", "C" (ใช้ .append())
เรียกคิว 1 คน (คนแรก) ออกไป (ใช้ .pop(0))
พิมพ์คนที่เหลือในคิว A B C D E
'''
def queue_bank():

    queue = []
    for _ in range(3):
        queue.append(input('custom: '))

    for _ in range(len(queue)):
        qpop = queue.pop(0)
        print('pop =', qpop)
        print('wait =', queue)

# queue_bank()


'''
ข้อ 2: จัดเรียงคะแนน (Sort)

มีคะแนน scores = [5, 2, 9, 1, 5]

จงเรียงคะแนนจากน้อยไปมาก (ใช้ .sort())

จงลบคะแนนที่น้อยที่สุดออก 1 ตัว (ใช้ .pop(0) หลังจากเรียงแล้ว)

พิมพ์คะแนนที่เหลือ'''
def sort_list():
    scores = [5, 2, 9, 1, 5]
    print(scores)

    scores.sort()
    scores.pop(0)
    print(scores)

sort_list()


'''

ข้อ 3: ค้นหาตำแหน่ง (Index - แบบฝึกหัด 5.2 ข้อ 5)
มีสินค้า items = ["Pen", "Pencil", "Ruler"]
มีราคา prices = [10, 5, 15]
โจทย์: อยากรู้ราคาของ "Pencil"?
วิธีทำ: หา index ของ "Pencil" จาก items ก่อน (ใช้ .index())
แล้วเอาเลข index นั้นไปดึงราคาจาก prices'''
def list_items():
    items = ['pen', 'pencil', 'puler']

    price = [10, 5, 15]

    index_price = items.index('pencil')

    i_price = price[index_price]

    print(index_price)
    print(i_price)

list_items()
