'''แบบฝึกหัด 6-4 ข้อที่ 1
จงเขียนฟังชัน fill(x,e) ที่รับ x เป็นลิสต์ และ e เป็นอะไรก็ได้ 
fill จะทำให้ทุกช่องใน x เก็บ e (fill ไม่คืนผลใด ๆ)'''

# อย่าเปลี่ยนแปลงหัวฟังก์ชันข้างล่างนี้
def fill(x, e):
    for i in range(len(x)):
        x[i] = e


'''แบบฝึกหัด 6-4 ข้อที่ 2
จงเขียนฟังชัน clip(x) ที่รับ x เป็นลิสต์ของจำนวนเต็ม 
ฟังก์ชันนี้จะเปลี่ยนทุกข้อมูลใน x ที่ติดลบให้เป็น 0 และเปลี่ยนทุกตัวลิสต์ที่เกิน 
255 ให้เป็น 255 (ฟังก์ชันนี้อาจเปลี่ยนค่าในลิสต์ x ที่รับมา ฟังก์ชันไม่คืนผลใด ๆ)'''

# อย่าเปลี่ยนแปลงหัวฟังก์ชันข้างล่างนี้
def clip(x):
    
    for i in range(len(x)):
        if x[i] < 0:
            x[i] = 0
        elif x[i] > 255:
            x[i] = 255


'''แบบฝึกหัด 6-4 ข้อที่ 3
จงเขียนฟังชัน replace(x,old,new,count) ที่รับ x เป็นลิสต์, old กับ new 
เป็นข้อมูลอะไรก็ได้ และ count เป็นจำนวนเต็ม ฟังก์ชันนี้จะเปลี่ยนข้อมูลใน x ที่มีค่า 
old ให้เป็น new เป็นจำนวนอย่างมาก count ตัว (นับจากซ้ายไปขวา) 
เช่น x = [1,2,3,3,3,2,3], replace(x,3,9,2) จะทำให้ 
x เปลี่ยนเป็น [1,2,9,9,3,2,3]'''

# อย่าเปลี่ยนแปลงหัวฟังก์ชันข้างล่างนี้
def replace(x:list, old, new, count:int):
    t = 0
    for i in range(len(x)):
        if x[i] == old:
            x[i] = new
            t += 1
            if t == count:
                break

