'''แบบฝึกหัด 5-5 ข้อที่ 1
กำหนดให้มีตัวแปร x เป็นลิสต์เก็บจำนวนเต็มมาให้แล้ว 
จงนับว่าใน x มีข้อมูลคู่ที่ติดกันเหมือนกันอยู่กี่คู่ 
เช่น x = [1,1,1,1,2,2] มีติดกันหมือนกันอยู่ 4 คู่'''

def more_than(num:list):
    count = 0
    for i in range(len(num) -1):
        if num[i] == num[i+1]:
            count += 1
    print('Count:', count)

more_than(num=[1,1,1,1,2,2])


'''แบบฝึกหัด 5-5 ข้อที่ 2
กำหนดให้มีตัวแปร x เป็นลิสต์เก็บจำนวนเต็มมาให้แล้ว จงตรวจว่า ข้อมูลใน x 
จากซ้ายไปขวา เรียงค่าจากน้อยไปมากหรือไม่ ถ้าใช่แสดง YES, ไม่ใช่ แสดง NO'''

def sort_least(x:list):
    y = False

    for i in range(len(x) -1):
        if x[i] > x[i+1]:
            y = True
    
    if y:
        print('NO')
    else:
        print('YES')

sort_least(x=[1,2,3,8,6,6])
